## [13] Konversi Nilai Numerik ke Dalam Sejumlah Kategori

### [13.1] Import Module

In [3]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

### [13.2] Persiapan Data Frame
- membentuk data frame yang terdiri dari 10 baris dan 1 kolom 
- isi dari data frame adalah angka random yang dimulai dari 1 - 99

In [4]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99,size=(n_rows,n_cols)),columns=cols)
df

   usia
0    45
1    94
2     7
3    12
4    90
5    52
6     9
7    39
8    68
9    52

### [13.3] Pengelompokan Nilai Numerik ke Dalam Beberapa Kategori Menggunakan Cut ()
Mengelompokkan usia sesuai dengan jangkauan umur :
1. Anak dengan usia 0-18 tahun
2. Dewasa dengan usia 18-65 tahun
3. Manula dengan usia 65-99 tahun

In [5]:
df ['kelompok_usia'] =  pd.cut(df['usia'],
                              bins = [0,18,65,99],
                              labels = ['anak','dewasa','manula'])
df

   usia kelompok_usia
0    45        dewasa
1    94        manula
2     7          anak
3    12          anak
4    90        manula
5    52        dewasa
6     9          anak
7    39        dewasa
8    68        manula
9    52        dewasa

## [14] Menggabungkan atau Merging Dua Pandas Data Frame

### [14.1] Import Module

In [6]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

### [14.2] Persiapan Data Frame
- Membentuk data frame dengan ukuran baris dan kolom 5 x 5 dengan isi data frame adalah integer random 1-20
- Untuk df1 merupakan salinan dari df akan tetapi baris 1 dan 4 dibuang
- Untuk df2 merupakan salinan dari df akan tetapi baris 0 dan 3 dibuang

In [9]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df

    A   B   C   D   E
0   5   3  19   1   4
1  15   8   8   4  16
2   4  10   1   8   5
3   5   7   2   4   9
4  10   5  13  13  17

In [10]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

   A   B   C  D  E
0  5   3  19  1  4
2  4  10   1  8  5
3  5   7   2  4  9

In [12]:
df2 = df.copy(deep=True)
df2 = df.drop([0,3])
df2

    A   B   C   D   E
1  15   8   8   4  16
2   4  10   1   8   5
4  10   5  13  13  17

### [14.3] Menggabungkan Dua Data Frame
#### Penggabungan dua data frame bisa dilakukan dengan banyak cara, akan tetapi pembahasan kali ini akan berfokus kepada teknik inner dan outer
- Penggabungan dengan teknik inner akan menghasilkan baris yang dimiliki oleh kedua data frame dan indeks setelah di-merge dengan teknik inner akan ter-reset kembali ke nol
- Penggabungan dengan teknik outer akan menggabungkan baris dari kedua data frame dan akan menghilangkan duplikasi diantara kedua data di dataframe

In [13]:
df_inner = pd.merge(df1,df2,how='inner')
df_inner

   A   B  C  D  E
0  4  10  1  8  5

In [14]:
df_outer = pd.merge(df1,df2,how='outer')
df_outer

    A   B   C   D   E
0   5   3  19   1   4
1   4  10   1   8   5
2   5   7   2   4   9
3  15   8   8   4  16
4  10   5  13  13  17